cjmccjmccjmc/ESP8266-WiFi-Analog-ClockV2/src/AnalogClock.cpp
//--------------------------------------------------------------------------
// Analog Clock
// Pulses the Lavet clock motor to keep the clock in sync with local time.
// Stores the clock's hour hand, minute hand and second hand positions in EERAM.
//--------------------------------------------------------------------------

#include <TimeLib.h>
#include <ESP8266WiFi.h>
#include <ESPNtpClient.h>
#include <Ticker.h>
#include <ESP8266WebServer.h>
#include "I2C_eeprom.h"

#include WifiDef.h

// WEMOS D1 Mini pins
#define D0 16                    // can't use D0 to generate interrupts
#define D1  5
#define D2  4
#define D3  0                    // 10K pull-up, boot fails if pulled LOW
#define D4  2                    // 10K pull-up, boot fails if pulled LOW, BUILTIN_LED,
#define D5 14
#define D6 12
#define D7 13
#define D8 15                    // 10K pull-down, boot fails if pulled HIGH

#define LOCAL_SDA D1                   // output to SDA on the EERam
#define LOCAL_SCL D2                   // output to SCL on the EERam
#define COIL1 D3                 // output to clock's lavet motor coil
#define COIL2 D7                 // output to clock's lavet motor coil
#define REDLED D5                // output to red part of the RGB LED
#define GREENLED D4              // output to green part of the RGB LED
#define BLUELED D8               // output to blue part of the RGB LED
#define SWITCHPIN D6             // input from push button switch

#define DEBOUNCE 50              // 50 milliseconds to debounce the puchbutton switch
#define PULSETIME 30             // 30 millisecond pulse for the lavet motor


#ifndef WIFISSID
#define WIFISSID "***"
#endif 

#ifndef PASSWORD
#define PASSWORD "***"    
#endif

#define HOUR     0x0001                         // address in EERAM for analogClkHour
#define MINUTE   HOUR+1                         // address in EERAM for analogClkMinute
#define SECOND   HOUR+2                         // address in EERAM for analogClkSecond
#define WEEKDAY  HOUR+3                         // address in EERAM for analogClkWeekday
#define DAY      HOUR+4                         // address in EERAM for analogClkDay
#define MONTH    HOUR+5                         // address in EERAM for analogClkMonth
#define YEAR     HOUR+6                         // address in EERAM for analogClkYear
#define TIMEZONE HOUR+7                         // address in EERAM for timezone
#define CHECK1   HOUR+8                         // address in EERAM for 1st check byte 0xAA
#define CHECK2   HOUR+9                         // address in EERAM for 2nd check byte 0x55

const char* NTPSERVERNAME =  "nz.pool.ntp.org";
 // #define NTPSERVERNAME "0.us.pool.ntp.org"
//#define NTPSERVERNAME "time.nist.gov"
//#define NTPSERVERNAME "time.windows.com"
//#define NTPSERVERNAME "time.google.com"
//#define NTPSERVERNAME "time-a-g.nist.gov"     // NIST, Gaithersburg, Maryland

// EERAM eeRAM(0x50);
I2C_eeprom ee(0x50, I2C_DEVICESIZE_24LC16);

ESP8266WebServer analogClkServer(80);
Ticker pulseTimer,clockTimer,ledTimer;
//REMOVE NTPEvent_t ntpEvent;                        // last NTP triggered event
String lastSyncTime = "";
String lastSyncDate = "";
boolean syncEventTriggered = false;             // true if an NTP time sync event has been triggered
boolean setupComplete = false;
boolean printTime = false;
volatile boolean switchInterruptFlag = false;
// int timeZone=-5;                               // EST
#define timeZone TZ_Pacific_Auckland
byte analogClkHour=0;
byte analogClkMinute=0;
byte analogClkSecond=0;
byte analogClkWeekday=0;
byte analogClkDay=0;
byte analogClkMonth=0;
byte analogClkYear=0;

// ISR functions should be defined with ICACHE_RAM_ATTR attribute to let the compiler know to never remove them from the IRAM. 
// If the ICACHE_RAM_ATTR attribute is missing the firmware will crash at the first call to attachInterrupt() on a ISR routine
// that happens not to be in ram at that moment. This bug will manifest itself only on some platform and some code configurations,
// as it entirely depends of where the compiler chooses to put the ISR functions.
void ICACHE_RAM_ATTR pinInterruptISR();
void handleRoot();
void blueLEDoff();
void greenLEDoff();
void pulseOff();
void pulseCoil();
void checkClock();

// Forward declarations
void syncNTPEventFunction(NTPEvent_t);
String getUpTime();

void doScan() {
   byte error, address;
  int nDevices;
 
  Serial.println("Scanning...");
 
  nDevices = 0;
  for(address = 1; address < 127; address++ )
  {
    // The i2c_scanner uses the return value of
    // the Write.endTransmisstion to see if
    // a device did acknowledge to the address.
    Wire.beginTransmission(address);
    error = Wire.endTransmission();
 
    if (error == 0)
    {
      Serial.print("I2C device found at address 0x");
      if (address<16)
        Serial.print("0");
      Serial.print(address,HEX);
      Serial.println("  !");
 
      nDevices++;
    }
    else if (error==4)
    {
      Serial.print("Unknown error at address 0x");
      if (address<16)
        Serial.print("0");
      Serial.println(address,HEX);
    }    
  }
  if (nDevices == 0)
    Serial.println("No I2C devices found\n");
  else
    Serial.println("done\n");
 
  delay(50000);           // wait 5 seconds for next scan

}


//--------------------------------------------------------------------------
// Setup
//--------------------------------------------------------------------------
void setup() {


   //--------------------------------------------------------------------------
   // configure hardware...
   //--------------------------------------------------------------------------
   // eeRAM.begin(SDA,SCL);
   //eeRAM.begin(LOCAL_SDA,LOCAL_SCL);
   // Note: to remove need to update schematic to swap over pins.
   Wire.pins(LOCAL_SDA, LOCAL_SCL);
   ee.begin();
   pinMode(SWITCHPIN,INPUT_PULLUP);
   attachInterrupt(digitalPinToInterrupt(SWITCHPIN),pinInterruptISR,FALLING); // interrupt when puchbutton is pressed   
   pinMode(COIL1,OUTPUT);
   pinMode(COIL2,OUTPUT);
   pinMode(REDLED,OUTPUT);
   pinMode(GREENLED,OUTPUT);
   pinMode(BLUELED,OUTPUT);
   digitalWrite(COIL1,LOW);
   digitalWrite(COIL2,LOW);
   digitalWrite(REDLED,LOW);
   digitalWrite(GREENLED,LOW);
   digitalWrite(BLUELED,LOW);

