cjmccjmccjmc/ESP8266-WiFi-Analog-ClockV2/src/AnalogClock.cpp
   //--------------------------------------------------------------------------      
   // print the banner... 
   //--------------------------------------------------------------------------
   Serial.begin(115200);  
   unsigned long waitTime = millis()+500;
   while(millis() < waitTime)yield();                          // wait one half second for the serial port
   Serial.println("\n\nAnalog Clock");
   Serial.printf("Sketch size: %u\n",ESP.getSketchSize());
   Serial.printf("Free size: %u\n",ESP.getFreeSketchSpace());
   Serial.print(ESP.getResetReason());
   Serial.println(" Reset");
   // doScan();

   //--------------------------------------------------------------------------
   // connect to WiFi...
   //--------------------------------------------------------------------------
   Serial.printf("Connecting to %s",WIFISSID);
   WiFi.begin(WIFISSID,PASSWORD);
   while (WiFi.status() != WL_CONNECTED) {
   waitTime = millis()+500;
   while(millis() < waitTime)yield();                          // wait one half second       
      Serial.print(".");                                       // print a "." every half second
   }
   Serial.println("\nConnected");

   //--------------------------------------------------------------------------
   // connect to the NTP server...
   //--------------------------------------------------------------------------
   NTP.begin(NTPSERVERNAME,true);                        // start the NTP client
   NTP.setTimeZone(timeZone);

   NTP.onNTPSyncEvent(syncNTPEventFunction);
   if (!NTP.setInterval(10,60)) Serial.println("Problem setting NTP interval.");

   byte waitCount = 500;
   Serial.print("Waiting for sync with NTP server");   
   while (timeStatus() != timeSet) {                           // wait until the the time is set and synced
      waitTime = millis()+500;
      while(millis() < waitTime)yield();                       // wait one half second       
      Serial.print(".");                                       // print a "." every half second
      --waitCount;
      if (waitCount==0) ESP.restart();                         // if time is not set and synced after 50 seconds, restart the ESP8266
   }

   //--------------------------------------------------------------------------
   // prompt for web configuration...
   //--------------------------------------------------------------------------
   while (Serial.available()) Serial.read();                  // empty the serial input buffer
   Serial.println("Press any key for web configuration.");
   byte count = 10;
   byte lastSec = second();                      
   boolean inputAvail = false;   
   while (count && !inputAvail) {
      byte thisSec = second();
      if (lastSec != thisSec) {
         lastSec = thisSec;
         Serial.printf("Waiting for %u seconds\n\r",count--);         
      }
      inputAvail = Serial.available();
   }
   byte c = Serial.read();
   //--------------------------------------------------------------------------
   // start the web server
   //--------------------------------------------------------------------------
   analogClkServer.on("/",handleRoot);
   analogClkServer.begin();

   //--------------------------------------------------------------------------
   // read analog clock values stored in EERam  
   //--------------------------------------------------------------------------

   Serial.print("CHECK1: should be ");
   Serial.print(0xAA);
   Serial.print(" is ");
   Serial.println(ee.readByte(CHECK1));
   Serial.print("CHECK2: should be ");
   Serial.print(0x55);
   Serial.print(" is ");
   Serial.println(ee.readByte(CHECK2));
   Serial.print("Inpt: ");
   Serial.print(inputAvail);
   Serial.print(" Inpt: ");
   Serial.println(!inputAvail);
   Serial.println();

   if((ee.readByte(CHECK1)==0xAA)&&(ee.readByte(CHECK2)==0x55)&&(!inputAvail)){
      Serial.println("\nReading values from EERAM.");
      analogClkHour = ee.readByte(HOUR);
      Serial.println("\nReading values from EERAM.");
      analogClkMinute = ee.readByte(MINUTE);
      Serial.println("\nReading values from EERAM.");
      analogClkSecond = ee.readByte(SECOND);
      Serial.println("\nReading values from EERAM.");
      analogClkWeekday = ee.readByte(WEEKDAY);
      Serial.println("\nReading values from EERAM.");
      analogClkDay = ee.readByte(DAY);
      Serial.println("\nReading values from EERAM.");
      analogClkMonth = ee.readByte(MONTH);
      Serial.println("\nReading values from EERAM.");
      analogClkYear = ee.readByte(YEAR);      
      Serial.println("\nReading values from EERAM.");
      int ignoretimeZone = ee.readByte(TIMEZONE); 
      Serial.println("\nReading values from EERAM.");
      setupComplete = true;      
   }
   //--------------------------------------------------------------------------   
   // get values from setup web page...   
   //--------------------------------------------------------------------------
   else {
      for (byte i=0;i<10;i++) {
         ee.writeByte(HOUR+i,0);                                // clear eeram     
      }
      
      Serial.printf("\nBrowse to %s to set up the analog clock.\n\r",WiFi.localIP().toString().c_str());
    
      byte lastSeconds = second();
      while(!setupComplete) {
         analogClkServer.handleClient();
         byte seconds = second();  
         if (lastSeconds != seconds) {
            lastSeconds = seconds;
            digitalWrite(BLUELED,HIGH);                            // flash the blue LED once each second while waiting for input to the web page
            ledTimer.once_ms(100,blueLEDoff);
         }
      }
   }
   clockTimer.attach_ms(100,checkClock);                      // start up 100 millisecond clock timer
}

//--------------------------------------------------------------------------
// Main Loop
//--------------------------------------------------------------------------
void loop() {
    static byte lastSeconds = 0; 

    // get any characters from the serial port
    if (Serial.available()) {
      char c = Serial.read();
    }

    // check to see if the pushbutton has been pressed
    if (switchInterruptFlag) {                                 // the pushbutton has been pressed
      switchInterruptFlag = false;
      Serial.println("Pushbutton!");
    }

    // flash the green LED once per second
    byte secs = second();  
    if (lastSeconds != secs) {                                 // when the second changes...
       lastSeconds = secs;                
       digitalWrite(GREENLED,HIGH);                            // turn on the green LED       
       ledTimer.once_ms(100,greenLEDoff);                      // turn off the green LED after 100 milliseconds
    }

    // print analog clock and actual time if values have changed  
    if (printTime) {                                           // when the analog clock is updated...
       printTime = false;
       Serial.printf("%02d:%02d:%02d  %02d:%02d:%02d\n\r",hour(),minute(),second(),analogClkHour,analogClkMinute,analogClkSecond);                      
    }

    // handle requests from the web server  
    analogClkServer.handleClient();                                 // handle requests from status web page

