cjmccjmccjmc/ESP8266-WiFi-Analog-ClockV2/src/AnalogClock.cpp
}

//------------------------------------------------------------------------
// Ticker callbacks that turns off the LEDs after 100 milliseconds.
//-------------------------------------------------------------------------
void blueLEDoff(){
   digitalWrite(BLUELED,LOW);                          
}

void greenLEDoff(){
   digitalWrite(GREENLED,LOW);                          
}

//------------------------------------------------------------------------
// Ticker callback that turns off the pulse to the analog clock Lavet motor
// after 30 milliseconds.
//-------------------------------------------------------------------------
void pulseOff() {
   digitalWrite(COIL1,LOW);
   digitalWrite(COIL2,LOW);
}

//--------------------------------------------------------------------------
// pulse the clock's Lavet motor to advance the second hand.
// The Lavet motor requires polarized control pulses. If the control pulses are inverted,
// the clock appears to run one second behind. To remedy the problem, invert the polarity
// of the control pulses. This is easily done by exchanging the wires connecting the Lavet motor.
//--------------------------------------------------------------------------
void pulseCoil() {
   if ((analogClkSecond%2)==0){                 // positive motor pulse on even seconds
      digitalWrite(COIL1,HIGH);
      digitalWrite(COIL2,LOW);
   }
   else {                                       // negative motor pulse on odd seconds
      digitalWrite(COIL1,LOW);
      digitalWrite(COIL2,HIGH);
   }
   pulseTimer.once_ms(PULSETIME,pulseOff);      // turn off pulse after 30 milliseconds...
}

//--------------------------------------------------------------------------
// Ticker callbacks run every 100 milliseconds that checks if the analog clock's 
// second hand needs to be advanced
//--------------------------------------------------------------------------
void checkClock() {
   time_t analogClkTime = makeTime({analogClkSecond,analogClkMinute,analogClkHour,analogClkWeekday,analogClkDay,analogClkMonth,analogClkYear});
   if (analogClkTime < now()) {                    // if the analog clock is behind the actual time and needs to be advanced...
      pulseCoil();                                 // pulse the motor to advance the analog clock's second hand
      if (++analogClkSecond==60){                  // since the clock motor has been pulsed, increase the seconds count
         analogClkSecond=0;                        // at 60 seconds, reset analog clock's seconds count back to zero
         if (++analogClkMinute==60) {
             analogClkMinute=0;                    // at 60 minutes, reset analog clock's minutes count back to zero
             if (++analogClkHour==24) {
                 analogClkHour=0;                  // at 24 hours, reset analog clock's hours count back to zero
                 analogClkWeekday=weekday();       // update values
                 analogClkDay=day();
                 analogClkMonth=month();
                 analogClkYear=year()-1970;   
                 
                 ee.writeByte(WEEKDAY,analogClkWeekday);// save the updated values in eeRAM
                 ee.writeByte(DAY,analogClkDay);
                 ee.writeByte(MONTH,analogClkMonth); 
                 ee.writeByte(YEAR,analogClkYear); 
             }
         }
      }
      ee.writeByte(HOUR,analogClkHour);             // save the new values in eeRAM
      ee.writeByte(MINUTE,analogClkMinute);
      ee.writeByte(SECOND,analogClkSecond); 
      printTime = false; // TODO                            // set flag to update display
      Serial.println("WRite2");

/*      
      Serial.print(analogClkHour); 
      Serial.print(" -> ");
      Serial.println(eeRAM.read(HOUR));
      Serial.print("  ");
      Serial.println(analogClkMinute);
      Serial.print(" -> ");
      Serial.println(eeRAM.read(MINUTE)); */
      Serial.print(analogClkSecond);      
      Serial.print(" -> ");
      Serial.println(ee.readByte(SECOND));
      /*
      Serial.print(analogClkWeekday);
      Serial.print(" -> ");
      Serial.println(eeRAM.read(WEEKDAY));
      Serial.print(analogClkDay);
      Serial.print(" -> ");
      Serial.println(eeRAM.read(DAY));
      Serial.print(analogClkMonth); 
      Serial.print(" -> ");
      Serial.println(eeRAM.read(MONTH));
      Serial.print(analogClkYear); 
      Serial.print(" -> ");
      Serial.println(eeRAM.read(YEAR));
      Serial.print(0);     
      Serial.print(" -> ");
      Serial.println(eeRAM.read(TIMEZONE));
      Serial.print(0xAA);
      Serial.print(" -> ");
      Serial.println(eeRAM.read(CHECK1));
      Serial.print(0x55);
      Serial.print(" -> ");
      Serial.println(eeRAM.read(CHECK2)); 
      */
  } // if (analogClkTime<now())   
}

//--------------------------------------------------------------------------
// Handles requests from the setup server client.
//--------------------------------------------------------------------------
void handleRoot() {
   if (setupComplete) {
      char timeStr[12];
      sprintf(timeStr,"%02d:%02d:%02d", analogClkHour,analogClkMinute,analogClkSecond);
      analogClkServer.send(200, "text/html",
      "<!DOCTYPE HTML>"
      "<html>"
        "<head>"
          "<META HTTP-EQUIV=\"refresh\" CONTENT=\"1\">"
          "<meta content=\"text/html; charset=utf-8\">"
          "<title> ESP8266 Analog Clock </title>"
        "</head>"
        "<body style=\"background-color:lightgrey;\">"
          "<h1>Analog Clock&nbsp;&nbsp;"+String(timeStr)+"</h1>"
          "<p>Uptime: "+getUpTime()+"</p>"
          "<p>Last NTP sync at "+lastSyncTime+" on "+lastSyncDate+"</p>"
        "</body>"
      "</html>");
   }
   else {
      analogClkServer.send(200, "text/html",
      "<!DOCTYPE HTML>"
      "<html>"
        "<head>"
          "<meta content=\"text/html; charset=utf-8\">"
          "<title>Analog Clock Setup</title>"
        "</head>"
        "<body>"
          "<form action=\"/\" method=\"POST\">"
          "<h1> Analog Clock Setup</h1>"
          "<p>Since the analog clock hands do not provide feedback of their position, you must specify<br>the starting position of the clock hour, minute and second hands. Do not leave any fields blank!</p>"
          "<ol>"
            "<li>Enter the current position of the hour, minute and second hands.</li>"
            "<li>Select your time zone.</li>"
            "<li>Click the \"Submit\" button.</li>"
          "</ol>"
          "<table>"
            "<tr><td><label>Hour   (0-11):</label></td><td><input type=\"number\" min=\"0\" max=\"23\" size=\"3\" name=\"hour\"   value=\"\"></td></tr>"
            "<tr><td><label>Minute (0-59):</label></td><td><input type=\"number\" min=\"0\" max=\"59\" size=\"3\" name=\"minute\" value=\"\"></td></tr>"
            "<tr><td><label>Second (0-59):</label></td><td><input type=\"number\" min=\"0\" max=\"59\" size=\"3\" name=\"second\" value=\"\"></td></tr>"
          "</table><br>"
          "Timezone:<br>"
          "&nbsp;<input type=\"radio\" name=\"timezone\" value=\"E\" checked>&nbsp;Auckland, New Zealand<br>"
          "<input type=\"submit\" value=\"Submit\">"
          "</form>"
        "</body>"
      "</html>");  

          
      if (analogClkServer.hasArg("hour")&&analogClkServer.hasArg("minute")&&analogClkServer.hasArg("second")&&analogClkServer.hasArg("timezone")) {
         String hourValue = analogClkServer.arg("hour");
         analogClkHour = hourValue.toInt();
         String minuteValue = analogClkServer.arg("minute");
         analogClkMinute = minuteValue.toInt();  
         String secondValue = analogClkServer.arg("second");
         analogClkSecond = secondValue.toInt();
         String zoneValue = analogClkServer.arg("timezone");
         /* switch(zoneValue[0]) {
            case 'E': timeZone = -5;  // Eastern Standard Time 5 hours after UTC
                      break;
            case 'C': timeZone = -6;  // Central Standard Time 6 hours after UTC
                      break;        
            case 'M': timeZone = -7;  // Mountain Standard Time 7 hours after UTC
                      break;        
            case 'P': timeZone = -8;  // Pacific Standard Time 8 hours after UTC
                      break;        
            default:  timeZone = -5;  // EST
         }*/
         analogClkWeekday=weekday();
         analogClkDay=day();
         analogClkMonth=month();
         analogClkYear=year()-1970; 

