cjmccjmccjmc/ESP8266-WiFi-Analog-ClockV2/src/AnalogClock.cpp
         // save the updated values in EERam...     
         ee.writeByte(HOUR,analogClkHour); 
         ee.writeByte(MINUTE,analogClkMinute);
         ee.writeByte(SECOND,analogClkSecond);      
         ee.writeByte(WEEKDAY,analogClkWeekday);
         ee.writeByte(DAY,analogClkDay);
         ee.writeByte(MONTH,analogClkMonth); 
         ee.writeByte(YEAR,analogClkYear); 
         ee.writeByte(TIMEZONE,0);     
         ee.writeByte(CHECK1,0xAA);
         ee.writeByte(CHECK2,0x55);
    

/*
         Serial.println("WRite1");
         Serial.print(analogClkHour); 
         Serial.print(" -> ");
         Serial.println(eeRAM.read(HOUR));
         Serial.print(analogClkMinute);
         Serial.print(" -> ");
         Serial.println(eeRAM.read(MINUTE));
         Serial.print(analogClkSecond);      
         Serial.print(" -> ");
         Serial.println(eeRAM.read(SECOND));
         Serial.print(analogClkWeekday);
         Serial.print(" -> ");
         Serial.println(eeRAM.read(WEEKDAY));
         Serial.print(analogClkDay);
         Serial.print(" -> ");
         Serial.println(eeRAM.read(DAY));
         Serial.print(analogClkMonth); 
         Serial.print(" -> ");
         Serial.println(eeRAM.read(MONTH));
         Serial.print(analogClkYear); 
         Serial.print(" -> ");
         Serial.println(eeRAM.read(YEAR));
         Serial.print(0);     
         Serial.print(" -> ");
         Serial.println(eeRAM.read(TIMEZONE));
         Serial.print(0xAA);
         Serial.print(" -> ");
         Serial.println(eeRAM.read(CHECK1));
         Serial.print(0x55);
         Serial.print(" -> ");
         Serial.println(eeRAM.read(CHECK2));
         */
         setupComplete = true;                               // set flag to indicate that we're done with setup   
      }
   }
}

//--------------------------------------------------------------------------
// Returns uptime as a formatted String: Days, Hours, Minutes, Seconds
//--------------------------------------------------------------------------
String getUpTime() {
   long uptime=millis()/1000;
   int d=uptime/86400;
   int h=(uptime%86400)/3600;
   int m=(uptime%3600)/60;
   int s=uptime%60;
   String daysStr="";
   if (d>0) (d==1) ? daysStr="1 day," : daysStr=String(d)+" days,";
   String hoursStr="";
   if (h>0) (h==1) ? hoursStr="1 hour," : hoursStr=String(h)+" hours,";
   String minutesStr="";
   if (m>0) (m==1) ? minutesStr="1 minute" : minutesStr=String(m)+" minutes";
   return daysStr+" "+hoursStr+" "+minutesStr;
}

//--------------------------------------------------------------------------
// NTP event handler
//--------------------------------------------------------------------------
void syncNTPEventFunction(NTPEvent_t e){

  switch(e.event) { 
    case noResponse:
      Serial.println("NTP server no response");
      break;
    
    case invalidAddress:
      Serial.println("NTP server can't find server");
      break;

    case invalidPort:
      Serial.println("NTP port already used");
      break;

    case requestSent:
      Serial.println("NTP request sent, waiting for response");
      break;

    case partlySync:
      Serial.println("Successful sync but offset was over threshold");
      break;

    case syncNotNeeded:
      Serial.println("Successful sync but offset was under minimum threshold");
      break;

    case errorSending:
      Serial.println("An error happened while sending the request");
      break;

    case responseError:
      Serial.println("Wrong response received");
      break;

    case syncError:
      Serial.println("Error adjusting time");
      break;

    case accuracyError:
      Serial.println("NTP server time is not accurate enough");
      break;

   case timeSyncd:
      lastSyncTime = NTP.getTimeStr(NTP.getLastNTPSync());
      lastSyncDate = NTP.getDateStr(NTP.getLastNTPSync());
      Serial.print("Got NTP time: ");
      Serial.print(lastSyncTime+"  ");
      Serial.println(lastSyncDate);

      setTime(NTP.getLastNTPSync());
      break;

    default:
      Serial.print("Unknown NTP sync process event: ");
      Serial.print(e.event);
      Serial.println();

  }

}

//--------------------------------------------------------------------------
// interrupt when the push button switch is pressed
//--------------------------------------------------------------------------
void pinInterruptISR() {
   unsigned long debounce_time = millis()+DEBOUNCE;
   while(millis() < debounce_time);               // wait 50 milliseconds for the switch contacts to stop bouncing
   switchInterruptFlag = true;
}
